{
  "//": "en",
  "banner": {
    "hello": "Hello my name is",
    "content": "Love programming and turn ideas into reality. Curious about every details in computer science. Try different ways to slove problem when facing challenges."
  },
  "about": "I have been self-learning programming for two years. I am proficient in using popular <strong className='font-Raleway'>React</strong> and <strong className='font-Raleway'>Vue</strong> frameworks and have developed a complete website useing <strong className='font-Raleway'>Express and MongoDB</strong>.",
  "works": {
    "description": {
      "title": "Here are a few projects I've worked on recently.",
      "metafame": {
        "header": " is a blockchain project developed by me and backend developer.",
        "content": "I was responsible for Staking & NFT page layout and interact with blockchain smart contract, build with <strong className='font-Raleway'>Next.js & Ethers.js</strong>. And introduced <strong className='font-Raleway'>TypeScript</strong> to reduce bug and maintain cost.<br/><br/>We developed staking and NFT character mint, makeover, refresh and wardrobe system for our customer. Also I use <strong className='font-Raleway'>Spine</strong> to play openbox, makeover animate and <strong className='font-Raleway'>SketchFab</strong> to show 3D NFT character"
      },
      "velhalla": {
        "header": " is my first blockchain project developed with a senior developer. We studied a lot of article for how to connect with blockchain and developed in two weeks",
        "content": "I was responsible for Stake & Comic & Metaverse page layout and interact with blockchain smart contract. We developed stake and trading comic NFT system, build with <strong className='font-Raleway'>Next.js & Web3.js</strong>.<br/><br/>This is my first time learning about blockchain, that just like connect with a unstable backend API. That's why we spend a lot of time with UI & UX."
      },
      "music": {
        "header": " is a side project that I want to practise with Vue 3.",
        "content": "build with <strong className='font-Raleway'>Vue CLI 4 & Vuex & Tailwind CSS</strong>, and use <strong className='font-Raleway'>Firebase Database</strong> to storage users & songs data.<br /><br/>In this side project practise, I was more familiar that how to developed with Vue 3. Also it was a good time to try to developing with Firebase."
      },
      "stores": {
        "header": " build with <strong className='font-Raleway'>Vue CLI</strong>.",
        "content": "I developing this websites at my last work, because I was working in a hardware store then. And learn <strong className='font-Raleway'>Vue & Vuex</strong> in my free time.<br />That's why I can develop this websites from the point of the users. It has a complete CMS that you can check all products and orders at PC and mobile device."
      },
      "emaily": {
        "header": "is a app that can send email survey to your users and collect their feedback.",
        "content": "In front-end, I build with <strong className='font-Raleway'>React</strong> and <strong className='font-Raleway'>Redux</strong>.<br />And use <strong className='font-Raleway'>Express</strong> and <strong className='font-Raleway'>MongoDB</strong> to build database server.<br />It's a good experience to learn about how AJAX works in server."
      },
      "maskmap": {
        "header": "could find masks close to your house or work",
        "content": "when people built maskmap in Taiwan, they usually use OSM and Leaflet. But I want to try the original <strong className='font-Raleway'>Google Maps API </strong>, becsuse its UI and API are beautiful and interesting.<br />In this time, I've learned a lot of how to use <strong className='font-Raleway'>Google Maps API </strong>."
      }
    },
    "visitbutton": "Visit Website"
  },
  "contact": {
    "remind": "※Please confirm your entries※",
    "formFields": [
      {
        "label": "Name",
        "name": "name"
      },
      {
        "label": "Email",
        "name": "email"
      },
      {
        "label": "Messages",
        "name": "messages"
      }
    ],
    "button": {
      "next": "Next",
      "cancel": "Cancel",
      "edit": "Edit",
      "send": "Send"
    },
    "error": {
      "required": "Please provide a {{name}}",
      "email": "The email is invalid: {{email}}"
    }
  },
  "infowindow": {
    "success": {
      "title": "Success !",
      "description": "I have already received your reply",
      "content": "and will get back to you shortly"
    },
    "warning": {
      "title": "Oops !",
      "description": "Something went wrong",
      "content": "Please wait for moment and try again on sending email"
    },
    "closebutton": "Close window"
  }
}
