{
  "description": {
    "title": "Here are a few projects I've worked on recently.",
    "metafame": {
      "header": " is a blockchain project developed by a backend developer and me.",
      "content": "I was responsible for Staking & NFT page layout, interacting with blockchain smart contracts, and building with <0>Next.js & Ethers.js</0>. And I introduced <0>TypeScript</0> to reduce bugs and maintain costs.<1></1><1></1>We developed staking and NFT character mint, makeover, refresh, and wardrobe systems for our customers. Also, I use <0>Spine</0> to play Openbox, makeover animate, and <0>SketchFab</0> to show 3D NFT characters."
    },
    "velhalla": {
      "header": "  is my first blockchain project developed with a senior developer. We studied a lot of articles on how to connect with blockchain and set in two weeks.",
      "content": "I was responsible for Stake & Comic & Metaverse page layout and interacted with blockchain smart contracts. We developed a stake and trading comic NFT system, built with <0>Next.js & Web3.js</0>.<1></1><1></1>It is my first time learning about blockchain, like connecting with an unstable backend API. So that's why we spend a lot of time with UI & UX."
    },
    "music": {
      "header": " is a side project that I want to code with Vue 3.",
      "content": "build with <0>Vue CLI 4 & Vuex & Tailwind CSS</0>, and use <0>Firebase Database</0> to store users & songs data.<1></1><1></1>On this side, project practice, I was more familiar with how to develop with Vue 3. Also, it was an excellent time to try to establish with Firebase."
    },
    "stores": {
      "header": " builds with <0>Vue CLI</0>.",
      "content": "I developed this website at my previous work, working in a hardware store then. And learn <0>Vue & Vuex</0> in my free time.<1></1><1></1>That's why I can develop this website from the point of view of the users. It has a complete CMS to check all products and orders on PC and mobile devices."
    },
    "emaily": {
      "header": " is an app that can send email surveys to your users and collect their feedback.",
      "content": "In the front-end, I build with <0>React</0> and <0>Redux</0>.<1></1><1></1>And use <0>Express</0> and <0>MongoDB</0> to build a database server.<1></1>It's a good experience to learn about how AJAX works on a server."
    },
    "maskmap": {
      "header": " could find masks close to your house or work",
      "content": "when people build mask maps in Taiwan. They usually use OSM and Leaflet. But I want to try the original <0>Google Maps API </0> because its UI and API are beautiful and interesting.<1></1><1></1>During this time, I've learned a lot about how to use <0>Google Maps API </0>."
    }
  },
  "visitbutton": "Visit Website"
}
